app/controllers/welcome_controller.rb

SELECT "games".* FROM "games" WHERE "games"."name" = 'foo' ORDER BY "games"."id" ASC LIMIT 1
---
  def show_game_by_name
    name = params[:name]
    game = Game.where(name: name).first